Tekla.Structures.ModelInternal.IInputGeometryEventsInternal
Interface for the Events class allows the user to register event listeners for Model UI internal events.
This interface allows the Marshaling of the Events class with Trimble.Remoting

Tekla.Structures.ModelInternal.IInputGeometryEventsInternal.ClientID
The ClienID